In [1]:
import pandas as pd
import numpy as np

In [2]:
myDict = {"ali" : 50 , "ahmet" : 20 ,"ayşe" : 30}

In [8]:
#Series

In [3]:
pd.Series(myDict) # series oluştur

ali      50
ahmet    20
ayşe     30
dtype: int64

In [6]:
name_list = ["ali","veli","ahmet","mehmet"]
age_list = [10,20,30,40]

In [7]:
pd.Series(data=age_list,index=name_list)

ali       10
veli      20
ahmet     30
mehmet    40
dtype: int64

In [11]:
np_array = np.arange(1,20) # np range fonksiyonu arange

In [12]:
pd.Series(np_array)

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
dtype: int32

In [16]:
np_array1 = np.array([10,20,30,40])

In [17]:
pd.Series(np_array1)

0    10
1    20
2    30
3    40
dtype: int32

In [19]:
pd.Series(data=np_array1,index=name_list)

ali       10
veli      20
ahmet     30
mehmet    40
dtype: int32

In [20]:
my_series = pd.Series(data=np_array1,index=name_list)

In [22]:
my_series[2]

30

In [23]:
my_series

ali       10
veli      20
ahmet     30
mehmet    40
dtype: int32

In [24]:
my_series["ali"]

10

In [25]:
my_series["ali"] = 20

In [26]:
my_series

ali       20
veli      20
ahmet     30
mehmet    40
dtype: int32

In [30]:
quiz_resault = pd.Series([10,50,60,78,200],["a","b","c","d","e"])

In [31]:
quiz_resault

a     10
b     50
c     60
d     78
e    200
dtype: int64

In [32]:
quiz_resault2 = pd.Series([13,40,60,38,300],["a","b","c","d","e"])

In [33]:
quiz_resault + quiz_resault2

a     23
b     90
c    120
d    116
e    500
dtype: int64

In [34]:
np.mean(quiz_resault)

79.6

In [35]:
# data frame

In [36]:
my_data = np.array([[10,20,30],[40,50,60],[70,80,90]]) # array numpy array

In [37]:
my_data

array([[10, 20, 30],
       [40, 50, 60],
       [70, 80, 90]])

In [38]:
my_namesRows = ["A","B","C"]
my_mounthColumns = ["jan","feb","mar"]

In [41]:
my_data_frame = pd.DataFrame(my_data) # dataframre oluştutrma

In [43]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [44]:
my_data_frame

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [45]:
my_data_frame[0]

0    10
1    40
2    70
Name: 0, dtype: int32

In [47]:
newDataFrame = pd.DataFrame(my_data ,index=my_namesRows ,columns=my_mounthColumns )

In [48]:
newDataFrame

   jan  feb  mar
A   10   20   30
B   40   50   60
C   70   80   90

In [50]:
newDataFrame["jan"]

A    10
B    40
C    70
Name: jan, dtype: int32

In [51]:
newDataFrame["A"]

KeyError: 'A'

In [52]:
feb_series = newDataFrame["feb"]

In [53]:
feb_series.mean()

50.0

In [54]:
newDataFrame[["jan","feb"]]

   jan  feb
A   10   20
B   40   50
C   70   80

In [55]:
newDataFrame.loc["A"] # a indexindeki verileri getir

jan    10
feb    20
mar    30
Name: A, dtype: int32

In [57]:
newDataFrame.iloc[2]

jan    70
feb    80
mar    90
Name: C, dtype: int32

In [58]:
newDataFrame["apr"] = newDataFrame["mar"]**2

In [59]:
newDataFrame

   jan  feb  mar   apr
A   10   20   30   900
B   40   50   60  3600
C   70   80   90  8100

In [60]:
newDataFrame.drop("C",axis=0) #row = axis=0

   jan  feb  mar   apr
A   10   20   30   900
B   40   50   60  3600

In [61]:
newDataFrame.drop("apr",axis=1)#axis=1 column

   jan  feb  mar
A   10   20   30
B   40   50   60
C   70   80   90

In [62]:
newDataFrame.drop("feb",axis=1,inplace=True)

In [63]:
newDataFrame

   jan  mar   apr
A   10   30   900
B   40   60  3600
C   70   90  8100

In [64]:
newDataFrame["apr"]["A"]

900

In [65]:
bollean_frame = newDataFrame > 50

In [66]:
bollean_frame

     jan    mar   apr
A  False  False  True
B  False   True  True
C   True   True  True

In [67]:
newDataFrame[bollean_frame]

    jan   mar   apr
A   NaN   NaN   900
B   NaN  60.0  3600
C  70.0  90.0  8100

In [69]:
newDataFrame[newDataFrame["jan"] > 40]

   jan  mar   apr
C   70   90  8100

In [70]:
newDataFrame.reset_index()

  index  jan  mar   apr
0     A   10   30   900
1     B   40   60  3600
2     C   70   90  8100

In [71]:
newDataFrame

   jan  mar   apr
A   10   30   900
B   40   60  3600
C   70   90  8100

In [72]:
newDataFrame["newİndex"] = ["aa","bb","cc"]

In [73]:
newDataFrame

   jan  mar   apr newİndex
A   10   30   900       aa
B   40   60  3600       bb
C   70   90  8100       cc

In [74]:
newDataFrame.set_index("newİndex")

          jan  mar   apr
newİndex
aa         10   30   900
bb         40   60  3600
cc         70   90  8100

In [75]:
newDataFrame.drop("newİndex",axis=1,inplace=True) # orijinal datafraamede değişiklik yapar inplace

In [76]:
newDataFrame

   jan  mar   apr
A   10   30   900
B   40   60  3600
C   70   90  8100